Super0415/TEST/GEC16W-1-S11X  V1.0/Sources/mc9s12xs128.h
    #define PER1AD0_PER1AD00_MASK       1U
    #define PER1AD0_PER1AD01_MASK       2U
    #define PER1AD0_PER1AD02_MASK       4U
    #define PER1AD0_PER1AD03_MASK       8U
    #define PER1AD0_PER1AD04_MASK       16U
    #define PER1AD0_PER1AD05_MASK       32U
    #define PER1AD0_PER1AD06_MASK       64U
    #define PER1AD0_PER1AD07_MASK       128U
    
  } Overlap_STR;

  struct {
    word PER1AD00    :1;                                       /* Port AD0 pull up enable bit 0 */
    word PER1AD01    :1;                                       /* Port AD0 pull up enable bit 1 */
    word PER1AD02    :1;                                       /* Port AD0 pull up enable bit 2 */
    word PER1AD03    :1;                                       /* Port AD0 pull up enable bit 3 */
    word PER1AD04    :1;                                       /* Port AD0 pull up enable bit 4 */
    word PER1AD05    :1;                                       /* Port AD0 pull up enable bit 5 */
    word PER1AD06    :1;                                       /* Port AD0 pull up enable bit 6 */
    word PER1AD07    :1;                                       /* Port AD0 pull up enable bit 7 */
    word PER0AD00    :1;                                       /* Port AD0 pull up enable bit 8 */
    word PER0AD01    :1;                                       /* Port AD0 pull up enable bit 9 */
    word PER0AD02    :1;                                       /* Port AD0 pull up enable bit 10 */
    word PER0AD03    :1;                                       /* Port AD0 pull up enable bit 11 */
    word PER0AD04    :1;                                       /* Port AD0 pull up enable bit 12 */
    word PER0AD05    :1;                                       /* Port AD0 pull up enable bit 13 */
    word PER0AD06    :1;                                       /* Port AD0 pull up enable bit 14 */
    word PER0AD07    :1;                                       /* Port AD0 pull up enable bit 15 */
  } Bits;
  struct {
    word grpPER1AD0 :8;
    word grpPER0AD0 :8;
  } MergedBits;
} PER01AD0STR;
extern volatile PER01AD0STR _PER01AD0 @(REG_BASE + 0x00000276UL);
#define PER01AD0                        _PER01AD0.Word
#define PER01AD0_PER1AD00               _PER01AD0.Bits.PER1AD00
#define PER01AD0_PER1AD01               _PER01AD0.Bits.PER1AD01
#define PER01AD0_PER1AD02               _PER01AD0.Bits.PER1AD02
#define PER01AD0_PER1AD03               _PER01AD0.Bits.PER1AD03
#define PER01AD0_PER1AD04               _PER01AD0.Bits.PER1AD04
#define PER01AD0_PER1AD05               _PER01AD0.Bits.PER1AD05
#define PER01AD0_PER1AD06               _PER01AD0.Bits.PER1AD06
#define PER01AD0_PER1AD07               _PER01AD0.Bits.PER1AD07
#define PER01AD0_PER0AD00               _PER01AD0.Bits.PER0AD00
#define PER01AD0_PER0AD01               _PER01AD0.Bits.PER0AD01
#define PER01AD0_PER0AD02               _PER01AD0.Bits.PER0AD02
#define PER01AD0_PER0AD03               _PER01AD0.Bits.PER0AD03
#define PER01AD0_PER0AD04               _PER01AD0.Bits.PER0AD04
#define PER01AD0_PER0AD05               _PER01AD0.Bits.PER0AD05
#define PER01AD0_PER0AD06               _PER01AD0.Bits.PER0AD06
#define PER01AD0_PER0AD07               _PER01AD0.Bits.PER0AD07
#define PER01AD0_PER1AD0                _PER01AD0.MergedBits.grpPER1AD0
#define PER01AD0_PER0AD0                _PER01AD0.MergedBits.grpPER0AD0

#define PER01AD0_PER1AD00_MASK          1U
#define PER01AD0_PER1AD01_MASK          2U
#define PER01AD0_PER1AD02_MASK          4U
#define PER01AD0_PER1AD03_MASK          8U
#define PER01AD0_PER1AD04_MASK          16U
#define PER01AD0_PER1AD05_MASK          32U
#define PER01AD0_PER1AD06_MASK          64U
#define PER01AD0_PER1AD07_MASK          128U
#define PER01AD0_PER0AD00_MASK          256U
#define PER01AD0_PER0AD01_MASK          512U
#define PER01AD0_PER0AD02_MASK          1024U
#define PER01AD0_PER0AD03_MASK          2048U
#define PER01AD0_PER0AD04_MASK          4096U
#define PER01AD0_PER0AD05_MASK          8192U
#define PER01AD0_PER0AD06_MASK          16384U
#define PER01AD0_PER0AD07_MASK          32768U
#define PER01AD0_PER1AD0_MASK           255U
#define PER01AD0_PER1AD0_BITNUM         0U
#define PER01AD0_PER0AD0_MASK           65280U
#define PER01AD0_PER0AD0_BITNUM         8U


/*** ATD0CTL01 - ATD 0 Control Register 01; 0x000002C0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0CTL0 - ATD 0 Control Register 0; 0x000002C0 ***/
    union {
      byte Byte;
      struct {
        byte WRAP0       :1;                                       /* Wrap Around Channel Select Bit 0 */
        byte WRAP1       :1;                                       /* Wrap Around Channel Select Bit 1 */
        byte WRAP2       :1;                                       /* Wrap Around Channel Select Bit 2 */
        byte WRAP3       :1;                                       /* Wrap Around Channel Select Bit 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpWRAP :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD0CTL0STR;
    #define ATD0CTL0                    _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Byte
    #define ATD0CTL0_WRAP0              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP0
    #define ATD0CTL0_WRAP1              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP1
    #define ATD0CTL0_WRAP2              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP2
    #define ATD0CTL0_WRAP3              _ATD0CTL01.Overlap_STR.ATD0CTL0STR.Bits.WRAP3
    /* ATD0CTL_ARR: Access 6 ATD0CTLx registers in an array */
    #define ATD0CTL_ARR                 ((volatile byte *) &ATD0CTL0)
    #define ATD0CTL0_WRAP               _ATD0CTL01.Overlap_STR.ATD0CTL0STR.MergedBits.grpWRAP
    
    #define ATD0CTL0_WRAP0_MASK         1U
    #define ATD0CTL0_WRAP1_MASK         2U
    #define ATD0CTL0_WRAP2_MASK         4U
    #define ATD0CTL0_WRAP3_MASK         8U
    #define ATD0CTL0_WRAP_MASK          15U
    #define ATD0CTL0_WRAP_BITNUM        0U
    

    /*** ATD0CTL1 - ATD 0 Control Register 1; 0x000002C1 ***/
    union {
      byte Byte;
      struct {
        byte ETRIGCH0    :1;                                       /* External Trigger Channel Select Bit 0 */
        byte ETRIGCH1    :1;                                       /* External Trigger Channel Select Bit 1 */
        byte ETRIGCH2    :1;                                       /* External Trigger Channel Select Bit 2 */
        byte ETRIGCH3    :1;                                       /* External Trigger Channel Select Bit 3 */
        byte SMP_DIS     :1;                                       /* Discharge Before Sampling Bit */
        byte SRES0       :1;                                       /* A/D Resolution Select Bit 0 */
        byte SRES1       :1;                                       /* A/D Resolution Select Bit 1 */
        byte ETRIGSEL    :1;                                       /* External Trigger Source Select */
      } Bits;
      struct {
        byte grpETRIGCH :4;
        byte     :1;
        byte grpSRES :2;
        byte     :1;
      } MergedBits;
    } ATD0CTL1STR;
    #define ATD0CTL1                    _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Byte
    #define ATD0CTL1_ETRIGCH0           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH0
    #define ATD0CTL1_ETRIGCH1           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH1
    #define ATD0CTL1_ETRIGCH2           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH2
    #define ATD0CTL1_ETRIGCH3           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGCH3
    #define ATD0CTL1_SMP_DIS            _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SMP_DIS
    #define ATD0CTL1_SRES0              _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SRES0
    #define ATD0CTL1_SRES1              _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.SRES1
    #define ATD0CTL1_ETRIGSEL           _ATD0CTL01.Overlap_STR.ATD0CTL1STR.Bits.ETRIGSEL
    #define ATD0CTL1_ETRIGCH            _ATD0CTL01.Overlap_STR.ATD0CTL1STR.MergedBits.grpETRIGCH
    #define ATD0CTL1_SRES               _ATD0CTL01.Overlap_STR.ATD0CTL1STR.MergedBits.grpSRES
    
    #define ATD0CTL1_ETRIGCH0_MASK      1U
    #define ATD0CTL1_ETRIGCH1_MASK      2U
    #define ATD0CTL1_ETRIGCH2_MASK      4U
    #define ATD0CTL1_ETRIGCH3_MASK      8U
    #define ATD0CTL1_SMP_DIS_MASK       16U
    #define ATD0CTL1_SRES0_MASK         32U
    #define ATD0CTL1_SRES1_MASK         64U
    #define ATD0CTL1_ETRIGSEL_MASK      128U
    #define ATD0CTL1_ETRIGCH_MASK       15U
    #define ATD0CTL1_ETRIGCH_BITNUM     0U
    #define ATD0CTL1_SRES_MASK          96U
    #define ATD0CTL1_SRES_BITNUM        5U
    
  } Overlap_STR;

