Super0415/TEST/GEC16W-1-S11X  V1.0/Sources/mc9s12xs128.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR10STR;
extern volatile ATD0DR10STR _ATD0DR10 @(REG_BASE + 0x000002E4UL);
#define ATD0DR10                        _ATD0DR10.Word
#define ATD0DR10_BIT0                   _ATD0DR10.Bits.BIT0
#define ATD0DR10_BIT1                   _ATD0DR10.Bits.BIT1
#define ATD0DR10_BIT2                   _ATD0DR10.Bits.BIT2
#define ATD0DR10_BIT3                   _ATD0DR10.Bits.BIT3
#define ATD0DR10_BIT4                   _ATD0DR10.Bits.BIT4
#define ATD0DR10_BIT5                   _ATD0DR10.Bits.BIT5
#define ATD0DR10_BIT6                   _ATD0DR10.Bits.BIT6
#define ATD0DR10_BIT7                   _ATD0DR10.Bits.BIT7
#define ATD0DR10_BIT8                   _ATD0DR10.Bits.BIT8
#define ATD0DR10_BIT9                   _ATD0DR10.Bits.BIT9
#define ATD0DR10_BIT10                  _ATD0DR10.Bits.BIT10
#define ATD0DR10_BIT11                  _ATD0DR10.Bits.BIT11
#define ATD0DR10_BIT12                  _ATD0DR10.Bits.BIT12
#define ATD0DR10_BIT13                  _ATD0DR10.Bits.BIT13
#define ATD0DR10_BIT14                  _ATD0DR10.Bits.BIT14
#define ATD0DR10_BIT15                  _ATD0DR10.Bits.BIT15

#define ATD0DR10_BIT0_MASK              1U
#define ATD0DR10_BIT1_MASK              2U
#define ATD0DR10_BIT2_MASK              4U
#define ATD0DR10_BIT3_MASK              8U
#define ATD0DR10_BIT4_MASK              16U
#define ATD0DR10_BIT5_MASK              32U
#define ATD0DR10_BIT6_MASK              64U
#define ATD0DR10_BIT7_MASK              128U
#define ATD0DR10_BIT8_MASK              256U
#define ATD0DR10_BIT9_MASK              512U
#define ATD0DR10_BIT10_MASK             1024U
#define ATD0DR10_BIT11_MASK             2048U
#define ATD0DR10_BIT12_MASK             4096U
#define ATD0DR10_BIT13_MASK             8192U
#define ATD0DR10_BIT14_MASK             16384U
#define ATD0DR10_BIT15_MASK             32768U


/*** ATD0DR11 - ATD 0 Conversion Result Register 11; 0x000002E6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR11H - ATD 0 Conversion Result Register 11 High; 0x000002E6 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR11HSTR;
    #define ATD0DR11H                   _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Byte
    #define ATD0DR11H_BIT8              _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT8
    #define ATD0DR11H_BIT9              _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT9
    #define ATD0DR11H_BIT10             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT10
    #define ATD0DR11H_BIT11             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT11
    #define ATD0DR11H_BIT12             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT12
    #define ATD0DR11H_BIT13             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT13
    #define ATD0DR11H_BIT14             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT14
    #define ATD0DR11H_BIT15             _ATD0DR11.Overlap_STR.ATD0DR11HSTR.Bits.BIT15
    
    #define ATD0DR11H_BIT8_MASK         1U
    #define ATD0DR11H_BIT9_MASK         2U
    #define ATD0DR11H_BIT10_MASK        4U
    #define ATD0DR11H_BIT11_MASK        8U
    #define ATD0DR11H_BIT12_MASK        16U
    #define ATD0DR11H_BIT13_MASK        32U
    #define ATD0DR11H_BIT14_MASK        64U
    #define ATD0DR11H_BIT15_MASK        128U
    

    /*** ATD0DR11L - ATD 0 Conversion Result Register 11 Low; 0x000002E7 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR11LSTR;
    #define ATD0DR11L                   _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Byte
    #define ATD0DR11L_BIT0              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT0
    #define ATD0DR11L_BIT1              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT1
    #define ATD0DR11L_BIT2              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT2
    #define ATD0DR11L_BIT3              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT3
    #define ATD0DR11L_BIT4              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT4
    #define ATD0DR11L_BIT5              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT5
    #define ATD0DR11L_BIT6              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT6
    #define ATD0DR11L_BIT7              _ATD0DR11.Overlap_STR.ATD0DR11LSTR.Bits.BIT7
    
    #define ATD0DR11L_BIT0_MASK         1U
    #define ATD0DR11L_BIT1_MASK         2U
    #define ATD0DR11L_BIT2_MASK         4U
    #define ATD0DR11L_BIT3_MASK         8U
    #define ATD0DR11L_BIT4_MASK         16U
    #define ATD0DR11L_BIT5_MASK         32U
    #define ATD0DR11L_BIT6_MASK         64U
    #define ATD0DR11L_BIT7_MASK         128U
    
  } Overlap_STR;

